############################## 基于PaddleGAN 实现唇形迁移 ###########################

###########################################################################################################################################################################
# Wav2lip模型原理
# Wav2lip实现唇形与语音精准同步突破的关键在于，它采用了唇形同步判别器，以强制生成器持续产生准确而逼真的唇部运动。

# 此外，该研究通过在鉴别器中，使用多个连续帧而不是单个帧，并使用视觉质量损失（而不仅仅是对比损失）来考虑时间相关性，从而改善了视觉质量。

# 该wav2lip模型几乎是万能的，适用于任何人脸、任何语音、任何语言，对任意视频都能达到很高的准确率，可以无缝地与原始视频融合，还可以用于转换动画人脸，并且导入合成语音也是可行的
###########################################################################################################################################################################

###########################################################################################################################################################################
#          下载PaddleGAN代码
# 下载PaddlePaddle安装包
%cd /home/aistudio/work

# 从github上克隆PaddleGAN代码（如下载速度过慢，可用gitee源）
!git clone https://gitee.com/PaddlePaddle/PaddleGAN
#!git clone https://github.com/PaddlePaddle/PaddleGAN

%cd /home/aistudio/work/PaddleGAN
!pip install -r requirements.txt
%cd applications/
#####################################################################################################################################################################################
#             唇形动作合成命令使用说明
#####################################################################################################################################################################################
# 只需在如下命令中的face参数和audio参数分别换成自己的视频和音频路径，然后运行如下命令，就可以生成和音频同步的视频。

# 程序运行完成后，会在当前文件夹下生成文件名为outfile参数指定的视频文件，该文件即为和音频同步的视频文件。本项目中提供了demo展示所用到的视频和音频文件。具体的参数使用说明如下：

# face: 原始视频，视频中的人物的唇形将根据音频进行唇形合成--通俗来说，想让谁说话
# audio：驱动唇形合成的音频，视频中的人物将根据此音频进行唇形合成--通俗来说，想让这个人说什么
#####################################################################################################################################################################################
!export PYTHONPATH=$PYTHONPATH:/home/aistudio/work/PaddleGAN && python tools/wav2lip.py --face /home/aistudio/work/奥特曼.jpg --audio /home/aistudio/work/芒种（消除背景音）.mp3 --outfile /home/aistudio/奥特曼教你唱芒种.mp4
